# -*- coding: utf-8 -*-

list_1 = [0, 1, 2]
list_2 = list_1

foo = [3, 4]

list_1 += foo
list_2.append(foo)

print(list_1, list_2)

# 正确选项：
# list_1                    list_2
# [0, 1, 2, 3, 4, [3, 4]]   [0, 1, 2, 3, 4, [3, 4]]
# 错误选项：
# [0, 1, 2, 3, 4]           [0, 1, 2, [3, 4]]
# [0, 1, 2, [3, 4]]         [0, 1, 2, 3, 4]
# [0, 1, 2, [3, 4], 3, 4]   [0, 1, 2, [3, 4], 3, 4]


# 说明：
# python 中针对 list 的赋值是浅拷贝， list_1 和 list_2 实际指向了同一个变量，针对 list_1 的 append 操作会同样作用于 list_2，反之亦然
# 如果需要复制 list_1 成为新的列表，应 list_2 = list_1[:]（针对其中的所有元素赋值，而非列表本身）